# -*- coding: utf-8 -*-
"""
Завдання 5.4a

Запросити користувача введення IP-мережі у форматі: 10.1.1.0 255.255.255.0

Потім вивести інформацію про мережу та маску в такому форматі:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Перевірити роботу скрипта на різних комбінаціях мережа/маска.

Вивід має бути впорядкований як у прикладі:
* стовпцями
* ширина стовпця 10 символів (у двійковому форматі треба додати два пробіли між
  стовпцями для поділу октетів між собою)

Приклад роботи завдання:

$ python task_5_4a.py
Enter network address: 10.1.1.0 255.255.255.0

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000


$ python task_5_4a.py
Enter network address: 10.1.1.192 255.255.255.240

Network:
10        1         1         192
00001010  00000001  00000001  11000000

Mask:
/28
255       255       255       240
11111111  11111111  11111111  11110000
"""


addresses = input('Enter ip address (format 10.1.1.0 255.255.255.0): ')
ip = addresses.split()[0].split('.')
mask = addresses.split()[1].split('.')
oct1, oct2, oct3, oct4 = [
    int(ip[0]),
    int(ip[1]),
    int(ip[2]),
    int(ip[3])
]
m1, m2, m3, m4 = [
    int(mask[0]),
    int(mask[1]),
    int(mask[2]),
    int(mask[3])
]
mask_short = str('{:b}{:b}{:b}{:b}'.format(m1, m2, m3, m4).count('1'))
template = '''{0:<8}  {1:<8}  {2:<8}  {3:<8}
{0:0>8b}  {1:0>8b}  {2:0>8b}  {3:0>8b}'''

print('\nNetwork:')
print(template.format(oct1, oct2, oct3, oct4))
print('\nMask:')
print('/' + mask_short)
print(template.format(m1, m2, m3, m4))
